tap "homebrew/cask"
tap "github/gh"
cask_args appdir: "/Applications"

brew "ack"
brew "act"
brew "asdf"
brew "awscli@1"
brew "autojump"
brew "bat"
brew "brew-cask-completion"
brew "dnsmasq"
brew "eslint"
brew "exercism"
brew "fzf"
brew "git"
brew "git-delta"
brew "gh"
brew "graphviz"
brew "grip"
brew "mas"
brew "navi"
brew "ncdu"
brew "openssl"
brew "prettier"
brew "watch"
brew "whalebrew"
brew "yarn"
brew "zplug"
brew "zsh"
brew "zsh-completions"

cask "1password-cli"
cask "docker"
cask "cask-fonts/font-fira-code"
cask "github"
cask "visual-studio-code"

mas "1Password 7", id: 1333542190
mas "CopyClip", id: 595191960
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835

whalebrew "whalebrew/httpie"
whalebrew "whalebrew/jq"
whalebrew "whalebrew/pygmentize"
whalebrew "whalebrew/speedtest"
