tap "homebrew/cask"
tap "github/gh"
cask_args appdir: "/Applications"

brew "ack"
brew "asdf"
brew "autojump"
brew "bat"
brew "brew-cask-completion"
brew "dnsmasq"
brew "eslint"
brew "exercism"
brew "fzf"
brew "git"
brew "git-delta"
brew "gh"
brew "graphviz"
brew "grip"
brew "mas"
brew "mysql"
brew "navi"
brew "ncdu"
brew "neovim"
brew "openssl"
brew "pgcli"
brew "postgresql"
brew "prettier"
brew "reattach-to-user-namespace"
brew "redis"
brew "tmux"
brew "vault"
brew "watch"
brew "whalebrew"
brew "yarn"
brew "zsh"
brew "zsh-completions"

cask "1password-cli"
cask "balenaetcher"
cask "blackhole" # https://github.com/ExistentialAudio/BlackHole
cask "docker"
cask "finicky"
cask "cask-fonts/font-fira-code"
cask "github"
cask "hyper"
cask "kindle"
cask "microsoft-office"
cask "popsql"
cask "postman"
cask "soulver"
cask "zsa-wally"

mas "1Password 7", id: 1333542190
mas "CopyClip", id: 595191960
mas "Grammarly", id: 1462114288
mas "JSONViewer", id: 1438520258
mas "Kiwi for Gmail Lite", id: 1006184923
mas "Magnet", id: 441258766
mas "PiPifier", id: 1160374471
mas "Slack", id: 803453959
mas "Xcode", id: 497799835

whalebrew "whalebrew/awscli"
whalebrew "whalebrew/httpie"
whalebrew "whalebrew/jq"
whalebrew "whalebrew/kubectl"
whalebrew "whalebrew/pygmentize"
whalebrew "whalebrew/speedtest"
