tap "homebrew/cask"
cask_args appdir: "/Applications"

brew "ack"
brew "asdf"
brew "autojump"
brew "awscli"
brew "bat"
brew "brew-cask-completion"
brew "ctags"
brew "denisidoro/tools/navi"
brew "diff-so-fancy"
brew "dnsmasq"
brew "eslint"
brew "exercism"
brew "fx"
brew "fzf"
brew "git"
brew "github/gh/gh"
brew "grip"
brew "howdoi"
brew "hub"
brew "jq"
brew "kubectl"
brew "ncdu"
brew "neovim"
brew "pgcli"
brew "postgresql"
brew "prettier"
brew "pygments"
brew "reattach-to-user-namespace"
brew "tldr"
brew "tmux"
brew "vault"
brew "watch"
brew "zsh"
brew "zsh-completions"

cask "docker"
cask "github"
cask "hiddenbar"
cask "homebrew/cask-drivers/zsa-wally"
cask "hyper"
cask "istat-menus"
cask "microsoft-office"
cask "popsql"
cask "postman"
cask "slack"
cask "soulver"
