tap "github/gh"
tap "athal7/opencode-pilot"

# CLI tools - descriptions after # are parsed into AGENTS.md
brew "ast-grep" # AST-based code search and transformation (pattern: `console.log($$$)`)
brew "autojump" # Directory jump based on frecency
brew "bat" # Better cat with syntax highlighting
brew "chezmoi" # Dotfiles manager
brew "colima" # Docker runtime for macOS
brew "direnv" # Per-directory environment variables
brew "docker" # Container runtime
brew "docker-compose" # Multi-container Docker applications
brew "ffmpeg" # Video/audio processing
brew "gh" # GitHub CLI for issues, PRs, repos
brew "ical-buddy" # Query macOS calendar events
brew "jc" # Convert CLI output to JSON (e.g., `ls -l | jc --ls`)
brew "jq" # JSON processing and querying
brew "kubernetes-cli" # Kubernetes CLI (kubectl)
brew "mas" # Mac App Store CLI
brew "neovim" # Modern Vim-based editor
brew "ollama" # Local LLM runtime
brew "opencode-pilot" # Automation daemon for OpenCode - polls issues and spawns sessions
brew "openssl" # TLS/SSL cryptography library
brew "opentofu" # Terraform-compatible infrastructure as code
brew "playwright-mcp" # Browser automation MCP server
brew "ripgrep" # Fast recursive grep (rg) - required by OpenCode
brew "starship" # Cross-shell prompt
brew "talisman" # Git secrets scanner (pre-commit hook)
brew "tmux" # Terminal multiplexer
brew "wakatime-cli" # Time tracking for developers
brew "watch" # Run commands periodically
brew "worktrunk" # Git worktree switcher (wt switch, wt list)

cask_args appdir: "/Applications"
cask "font-monaspace" # Monospace font family
cask "kitty" # GPU-accelerated terminal emulator
cask "mac-mouse-fix" # Mouse customization utility
cask "opencode-desktop" # AI coding assistant desktop app
cask "stats" # Menu bar system monitor (CPU, memory, disk, network)
cask "tailscale-app" # Mesh VPN for secure networking
cask "visual-studio-code" # Code editor
