tap "github/gh"
tap "open-cli-collective/tap"
tap "silverstein/tap"
tap "steipete/tap"

# CLI tools - descriptions after # are parsed into AGENTS.md
brew "autojump" # Directory jump based on frecency
brew "bat" # Better cat with syntax highlighting
brew "chezmoi" # Dotfiles manager
brew "colima" # Docker runtime for macOS
brew "direnv" # Per-directory environment variables
brew "docker" # Container runtime
brew "docker-compose" # Multi-container Docker applications
brew "ffmpeg" # Video/audio processing
brew "gh" # GitHub CLI for issues, PRs, repos
brew "git-spice" # Manage stacked Git branches
brew "jc" # Convert CLI output to JSON (e.g., `ls -l | jc --ls`)
brew "jq" # JSON processing and querying
brew "graphqurl" # GraphQL CLI — query any GraphQL API with variables support (gq)
brew "k9s" # Terminal UI for Kubernetes clusters
brew "kubernetes-cli" # Kubernetes CLI (kubectl)
brew "mas" # Mac App Store CLI
brew "mise" # Polyglot version manager (ruby, node, python, rust, etc.)
brew "neovim" # Modern Vim-based editor
brew "ollama" # Local LLM runtime
brew "opencode" # AI coding assistant CLI
brew "openssl" # TLS/SSL cryptography library
brew "opentofu" # Terraform-compatible infrastructure as code
brew "ripgrep" # Fast recursive grep (rg) - required by OpenCode
brew "starship" # Cross-shell prompt
brew "talisman" # Git secrets scanner (pre-commit hook)
brew "wakatime-cli" # Time tracking for developers
brew "watch" # Run commands periodically
brew "steipete/tap/remindctl" # Apple Reminders CLI — headless read/write without TCC issues
brew "ical-buddy" # Fast calendar event reader — no Calendar.app TCC issues
brew "worktrunk" # Git worktree switcher (wt switch, wt list)
brew "googleworkspace-cli" # Google Workspace CLI (gws) for Drive, Gmail, Calendar, Sheets, Docs, Chat
cask "open-cli-collective/tap/cfl" # Confluence CLI for searching and reading pages

cask_args appdir: "/Applications"
cask "gcloud-cli" # Google Cloud CLI (gcloud, gsutil, bq)
cask "font-monaspace" # Monospace font family
cask "ghostty" # GPU-accelerated terminal emulator
cask "mac-mouse-fix" # Mouse customization utility
cask "opencode-desktop" # AI coding assistant desktop app
brew "silverstein/tap/minutes" # Meeting recorder CLI (record, search, import, transcription)
cask "silverstein/tap/minutes" # Minutes desktop app (menu bar, recording UI, AI assistant)
cask "stats" # Menu bar system monitor (CPU, memory, disk, network)
cask "tailscale-app" # Mesh VPN for secure networking
